Ran Plan for 2 projects:

1. project: `sandbox-storage` dir: `environments/sandbox/us-east-1/storage` workspace: `default`
1. project: `production-storage` dir: `environments/production/us-east-1/storage` workspace: `default`
---

### 1. project: `sandbox-storage` dir: `environments/sandbox/us-east-1/storage` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2025-08-21T13:43:03-04:00 level=info msg=Downloading Terraform configurations from git::ssh://git@github.com/backendken/mini-mod.git into /Users/kenspatta/.atlantis/repos/backendken/mini-elo/3/default/environments/sandbox/us-east-1/storage/.terragrunt-cache/1PmLVgCC-S-Z3xSWfaO3pjSUJYo/2rO4fgo8rEPGLA8QFQIHucEyBlg

Initializing the backend...

Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/local versions matching "~> 2.0"...
- Finding hashicorp/null versions matching "~> 3.0"...
- Installing hashicorp/null v3.2.4...
- Installed hashicorp/null v3.2.4 (signed by HashiCorp)
- Installing hashicorp/local v2.5.3...
- Installed hashicorp/local v2.5.3 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.storage_config will be created
  + resource "local_file" "storage_config" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output/sandbox-data-bucket.json"
      + id                   = (known after apply)
    }

  # null_resource.storage_validator will be created
  + resource "null_resource" "storage_validator" {
      + id       = (known after apply)
      + triggers = {
          + "storage_name" = "sandbox-data-bucket"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + storage_id   = "./output/sandbox-data-bucket.json"
  + storage_name = "sandbox-data-bucket"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/Users/kenspatta/.atlantis/repos/backendken/mini-elo/3/default/environments/sandbox/us-east-1/storage/sandbox-storage-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/kenspatta/.atlantis/repos/backendken/mini-elo/3/default/environments/sandbox/us-east-1/storage/sandbox-storage-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sandbox-storage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://localhost:4141/lock?id=backendken%252Fmini-elo%252Fenvironments%252Fsandbox%252Fus-east-1%252Fstorage%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sandbox-storage
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. project: `production-storage` dir: `environments/production/us-east-1/storage` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2025-08-21T13:43:02-04:00 level=info msg=Downloading Terraform configurations from git::ssh://git@github.com/backendken/mini-mod.git into /Users/kenspatta/.atlantis/repos/backendken/mini-elo/3/default/environments/production/us-east-1/storage/.terragrunt-cache/qF9Z-yoLxp4n7m9qlXH5PqnRP6w/2rO4fgo8rEPGLA8QFQIHucEyBlg

Initializing the backend...

Successfully configured the backend "local"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/local versions matching "~> 2.0"...
- Finding hashicorp/null versions matching "~> 3.0"...
- Installing hashicorp/local v2.5.3...
- Installed hashicorp/local v2.5.3 (signed by HashiCorp)
- Installing hashicorp/null v3.2.4...
- Installed hashicorp/null v3.2.4 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.storage_config will be created
  + resource "local_file" "storage_config" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output/production-data-bucket.json"
      + id                   = (known after apply)
    }

  # null_resource.storage_validator will be created
  + resource "null_resource" "storage_validator" {
      + id       = (known after apply)
      + triggers = {
          + "storage_name" = "production-data-bucket"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + storage_id   = "./output/production-data-bucket.json"
  + storage_name = "production-data-bucket"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/Users/kenspatta/.atlantis/repos/backendken/mini-elo/3/default/environments/production/us-east-1/storage/production-storage-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/kenspatta/.atlantis/repos/backendken/mini-elo/3/default/environments/production/us-east-1/storage/production-storage-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production-storage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://localhost:4141/lock?id=backendken%252Fmini-elo%252Fenvironments%252Fproduction%252Fus-east-1%252Fstorage%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production-storage
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```